%% 根据设定的a_bcc计算得到新的原子半径和数量

function [radius, N] = cal_bcc_radius(a_bcc, r_cut)
% a_bcc为BCC相的晶格常数，r_cut为势函数的截断半径
alpha_bcc = [0.866025403784, 1.000000000000, 1.414213562373, 1.658312395178, 1.732050807569, 2.000000000000, ...
    2.179449471770, 2.236067977500, 2.449489742783, 2.598076211353, 2.828427124746, 2.958039891550, 3.000000000000, 3.162277660168];
N_bcc = [8, 6, 12, 24, 8, 6, 24, 24, 24, 32, 12, 48, 30, 24];

radius = alpha_bcc * a_bcc;
N = N_bcc;

idx = radius < r_cut;
radius = radius(idx);
N = N(idx);
end